Examinator/src/Documents/РассылкаСообщенийСУО/РассылкаСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РассылкаСообщенийСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <basedOn>Catalog.УчебныеГруппыСУО</basedOn>
  <basedOn>Document.ПроведениеОбученияСУО</basedOn>
  <basedOn>Document.ПроведениеПрограммыОбученияСУО</basedOn>
  <basedOn>Catalog.СерииПинКодовСУО</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.СерииПинКодовСУО</types>
      <types>DocumentRef.ВосстановлениеПароляСУ</types>
      <types>CatalogRef.ОтборыПользователейСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеАвтоматическойРассылки</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.НовостьСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтоматическойРассылки</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторуАвтоматическойРассылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподавателям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организаторам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезШаблона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьФайлыОснования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>DocumentRef.СообщениеСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправленоНаЭлектроннуюПочту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправкаНаЭлектроннуюПочтуЗапрещена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПопытокОтправкиНаЭлектроннуюПочту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/УчастникиОбученияСУО/УчастникиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтсчетаПродолжительности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПродолжительности</name>
    <type>
      <types>EnumRef.ПродолжительностьОбученияСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ВремяДоступаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяДоступаПользователейСУО</name>
  <attributes>
    <name>ДатаНачалаДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СтудентыОО/СтудентыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтудентыОО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.КурсыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСтудентовОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.СпециализацииОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/АдресатыСообщенийСУО/АдресатыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АдресатыСообщенийСУО</name>
  <enumValues>
    <name>НаФоруме</name>
  </enumValues>
  <enumValues>
    <name>УчастникамМероприятия</name>
  </enumValues>
  <enumValues>
    <name>УчастникамПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>УчастникуМероприятия</name>
  </enumValues>
  <enumValues>
    <name>УчастникуПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>Преподавателям</name>
  </enumValues>
  <enumValues>
    <name>Преподавателю</name>
  </enumValues>
  <enumValues>
    <name>УчебнойГруппе</name>
  </enumValues>
  <enumValues>
    <name>Пользователю</name>
  </enumValues>
  <enumValues>
    <name>Администратору</name>
  </enumValues>
  <enumValues>
    <name>Организатору</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ШаблоныСообщенийСУО/ШаблоныСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСообщенийСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ТипыШаблоновСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтоматическойРассылки</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Переменные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПеременные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПеременной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Documents/РассылкаСообщенийСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет табличную часть ЗначенияПеременных
// на основании шаблона рассылки и основания
//
Процедура ЗаполнитьПеременные() Экспорт
	
	ЗначенияПеременных.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Шаблон) ИЛИ ТипЗнч(Шаблон) <> Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПеременных = Справочники.ШаблоныСообщенийСУО.Переменные(Шаблон);	
	
	Для каждого Строка Из ТаблицаПеременных Цикл
		
		НоваяСтрокаТЧ = ЗначенияПеременных.Добавить();
		НоваяСтрокаТЧ.Переменная = Строка.Переменная;
		
		Основания = Новый Массив();
		Основания.Добавить(Основание);
		Основания.Добавить(ОснованиеАвтоматическойРассылки);
		
		Если ТипЗнч(Основание) = Тип("СправочникСсылка.ОтборыПользователейСУО")
			И ТипЗнч(ОснованиеАвтоматическойРассылки) = Тип("СправочникСсылка.Пользователи") Тогда
			
			// Если рассылка сформировалась через отбор пользователей,
			// то пытаемся однозначно определить сценарий обучения и прохождения обучения
			// того пользователя, для которого формируется рассылка. Если это возможно,
			// то добавляем их в массив основание. Это позволит заполнить переменные,
			// связанные с обучением при формировании сообщения по шаблону.
			
			ПрохождениеОбучения = Неопределено;
			ОтборПользователей = Основание;
			Учащийся = ОснованиеАвтоматическойРассылки;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОтборыПользователейСУООбучение.СценарийОбучения КАК ОбучениеВОтборе
				|ИЗ
				|	Справочник.ОтборыПользователейСУО.Обучение КАК ОтборыПользователейСУООбучение
				|ГДЕ
				|	ОтборыПользователейСУООбучение.Ссылка = &ОтборПользователей";
			
			Запрос.УстановитьПараметр("ОтборПользователей", ОтборПользователей);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда			
				
				ВыборкаДетальныеЗаписи.Следующий();
				ОбучениеВОтборе = ВыборкаДетальныеЗаписи.ОбучениеВОтборе;
				
				Основания.Добавить(ОбучениеВОтборе);
				
				Если ТипЗнч(ОбучениеВОтборе) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
					
					СценарийОбучения = Документы.ПроведениеОбученияСУО.СценарийОбучения(ОбучениеВОтборе);
					ПрохождениеОбучения = Документы.ПроведениеОбученияСУО.ПрохождениеОбучения(ОбучениеВОтборе, СценарийОбучения, Учащийся);
					
				ИначеЕсли ТипЗнч(ОбучениеВОтборе) = Тип("СправочникСсылка.ВидыМероприятийСУО") Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	УчастникиОбученияСУО.Регистратор КАК ПрохождениеОбучения,
						|	УчастникиОбученияСУО.ПроведениеОбучения
						|ИЗ
						|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
						|ГДЕ
						|	УчастникиОбученияСУО.Вид = &ВидОбучения
						|	И УчастникиОбученияСУО.Пользователь = &Пользователь
						|
						|УПОРЯДОЧИТЬ ПО
						|	УчастникиОбученияСУО.ДатаНачалаПрохождения УБЫВ";
					
					Запрос.УстановитьПараметр("Пользователь", Учащийся);
					Запрос.УстановитьПараметр("ВидОбучения", ОбучениеВОтборе);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда					
						ВыборкаДетальныеЗаписи.Следующий();
						ПрохождениеОбучения = ВыборкаДетальныеЗаписи.ПрохождениеОбучения; 
						Основания.Добавить(ВыборкаДетальныеЗаписи.ПроведениеОбучения);
					КонецЕсли;					
					
				Иначе
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ ПЕРВЫЕ 1
						|	УчастникиОбученияСУО.Регистратор КАК ПрохождениеОбучения,
						|	УчастникиОбученияСУО.ПроведениеОбучения
						|ИЗ
						|	РегистрСведений.УчастникиОбученияСУО КАК УчастникиОбученияСУО
						|ГДЕ
						|	УчастникиОбученияСУО.Сценарий = &Сценарий
						|	И УчастникиОбученияСУО.Пользователь = &Пользователь
						|
						|УПОРЯДОЧИТЬ ПО
						|	УчастникиОбученияСУО.ДатаНачалаПрохождения УБЫВ";
					
					Запрос.УстановитьПараметр("Пользователь", Учащийся);
					Запрос.УстановитьПараметр("Сценарий", ОбучениеВОтборе);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда					
						ВыборкаДетальныеЗаписи.Следующий();
						ПрохождениеОбучения = ВыборкаДетальныеЗаписи.ПрохождениеОбучения; 
						Основания.Добавить(ВыборкаДетальныеЗаписи.ПроведениеОбучения);
					КонецЕсли;

				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
				Основания.Добавить(ПрохождениеОбучения);
			КонецЕсли;
			
		КонецЕсли;
		
		Для каждого ТекущееОснование Из Основания Цикл
		
			Если НЕ ЗначениеЗаполнено(ТекущееОснование) Тогда
				Продолжить;
			КонецЕсли;
				
			ТипОснования = ТипЗнч(ТекущееОснование);
			
			Если ТипЗнч(Строка.Переменная) = Тип("ПланВидовХарактеристикСсылка.ПеременныеШаблоновСообщенийСУО") Тогда
			
				Если Строка.Переменная.ТипЗначения.СодержитТип(ТипОснования) Тогда
					НоваяСтрокаТЧ.Значение = ТекущееОснование;
				КонецЕсли;
				
				Если (ТипОснования = Тип("ДокументСсылка.ПроведениеОбученияСУО"))
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогМероприятийСУО"))
					И ЗначениеЗаполнено(ТекущееОснование.Мероприятие) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Мероприятие;
					
				КонецЕсли;
				
				Если (ТипОснования = Тип("ДокументСсылка.ПроведениеОбученияСУО"))
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СводыЗнанийСУЗ"))
					И ЗначениеЗаполнено(ТекущееОснование.ЭлектронныйРесурс) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ЭлектронныйРесурс;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО") 
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогМероприятийСУО"))
					И ЗначениеЗаполнено(ТекущееОснование.Сценарий)
					И ТипЗнч(ТекущееОснование.Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
					
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Сценарий;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО") 
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.СводыЗнанийСУЗ"))
					И ЗначениеЗаполнено(ТекущееОснование.Сценарий)
					И ТипЗнч(ТекущееОснование.Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
					
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Сценарий;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогПрограммОбученияСУО")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ПрограммаОбучения;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПроведениеОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ПроведениеПрограммыОбучения;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("ДокументСсылка.ПроведениеОбученияСУО")) Тогда
					
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ПроведениеОбучения;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогМероприятийСУО")) Тогда
					
					СценарийОбучения = Документы.ПрохождениеОбученияСУО.СценарийОбучения(ТекущееОснование.ПрохождениеОбучения);
					Если ТипЗнч(СценарийОбучения) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
						НоваяСтрокаТЧ.Значение = СценарийОбучения;
					КонецЕсли;
					
				КонецЕсли;				

				Если ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КаталогМероприятийСУО")) Тогда
					
					СценарийОбучения = Документы.ПрохождениеОбученияСУО.СценарийОбучения(ТекущееОснование);
					Если ТипЗнч(СценарийОбучения) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
						НоваяСтрокаТЧ.Значение = СценарийОбучения;
					КонецЕсли;
					
				КонецЕсли;				
				
				Если ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("ДокументСсылка.ПроведениеОбученияСУО")) Тогда
					
					НоваяСтрокаТЧ.Значение = ТекущееОснование.ПроведениеОбучения;
					
				КонецЕсли;				
				
				Если (ТипОснования = Тип("ДокументСсылка.ПроведениеОбученияСУО"))
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.АудиторииСУО"))
					И ЗначениеЗаполнено(ТекущееОснование.Аудитория) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Аудитория;
					
				КонецЕсли;
				
				Если (ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО") ИЛИ ТипОснования = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО"))
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Пользователь;
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Пользователь;
					
				КонецЕсли;
								
				Если ТипОснования = Тип("ДокументСсылка.ВосстановлениеПароляСУ")
					И Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.АдресДляПерехода Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.АдресСтраницыВосстановления + "#/changePassword/" + Строка(ТекущееОснование.УникальныйИдентификатор()) + "/" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущееОснование, "КодВосстановления"));
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ВосстановлениеПароляСУ")
					И Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КодПодтверждения Тогда
				
					НоваяСтрокаТЧ.Значение = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ТекущееОснование.КодВосстановления);
					
				КонецЕсли;
				
				Если ТипОснования = Тип("ДокументСсылка.ВосстановлениеПароляСУ")
					И Строка.Переменная.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
				
					НоваяСтрокаТЧ.Значение = ТекущееОснование.Пользователь;
					
				КонецЕсли;
				
				Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ЛогинПользователя Тогда
					
					Пользователь = ПользовательОснования(ТекущееОснование);
					
					Если ЗначениеЗаполнено(Пользователь) Тогда
					
						ПрочитанныеСвойства = Неопределено;
						ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
						
						Если Пользователи.ПрочитатьПользователяИБ(ИдентификаторПользователяИБ, ПрочитанныеСвойства) Тогда				
							НоваяСтрокаТЧ.Значение = ПрочитанныеСвойства.Имя;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;				
				
				Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе
					ИЛИ Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаОкончанияДоступаПользователяКБазе Тогда

					Пользователь = ПользовательОснования(ТекущееОснование);
					
					Если ЗначениеЗаполнено(Пользователь) Тогда
						
						ДатыДоступа = РегистрыСведений.ВремяДоступаПользователейСУО.ДатыДоступа(Пользователь);
						
						Если ДатыДоступа <> Неопределено Тогда
						
							Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ДатаНачалаДоступаПользователяКБазе Тогда
								НоваяСтрокаТЧ.Значение = ДатыДоступа.ДатаНачалаДоступа;
								НоваяСтрокаТЧ.Значение = ОбщегоНазначенияСУКлиентСервер.ДатаВСтроку(НоваяСтрокаТЧ.Значение, Ложь, Ложь, Истина);
							Иначе
								НоваяСтрокаТЧ.Значение = ДатыДоступа.ДатаОкончанияДоступа;
								НоваяСтрокаТЧ.Значение = ОбщегоНазначенияСУКлиентСервер.ДатаВСтроку(НоваяСтрокаТЧ.Значение, Ложь, Истина, Истина);
							КонецЕсли;
							
						КонецЕсли;
							
					КонецЕсли;
					
				КонецЕсли;
				
				Если Строка.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.УчебнаяГруппа Тогда
					
					Пользователь = ПользовательОснования(ТекущееОснование);
					
					Если ЗначениеЗаполнено(Пользователь) Тогда

						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	УчебныеГруппыСУОСостав.Ссылка.Наименование КАК НаименованиеГруппы
							|ИЗ
							|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
							|ГДЕ
							|	УчебныеГруппыСУОСостав.Пользователь = &Пользователь
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|
							|ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	СтудентыООСрезПоследних.УчебнаяГруппа.Наименование
							|ИЗ
							|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
							|ГДЕ
							|	СтудентыООСрезПоследних.Пользователь = &Пользователь";
						
						Запрос.УстановитьПараметр("Пользователь", Пользователь);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
							НоваяСтрокаТЧ.Значение = "";
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								НоваяСтрокаТЧ.Значение = НоваяСтрокаТЧ.Значение + ВыборкаДетальныеЗаписи.НаименованиеГруппы + " ";								
							КонецЦикла;
						КонецЕсли;
						
					КонецЕсли;

					
				КонецЕсли;
				
			КонецЕсли;
				
			Если ТипЗнч(Строка.Переменная) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения")
				ИЛИ ТипЗнч(Строка.Переменная) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
				
				Пользователь = ПользовательОснования(ТекущееОснование);
				
				Если ЗначениеЗаполнено(Пользователь) Тогда
					
					ТаблицаЗначенийДопПеременных = УправлениеОбучениемСУО.ТаблицаЗначенийДополнительныхПеременных(ТаблицаПеременных, Пользователь);
					
					СтрокаТЗДП = ТаблицаЗначенийДопПеременных.Найти(Строка.Переменная, "Переменная");
					НоваяСтрокаТЧ.Значение = СтрокаТЗДП.Значение;
					
				КонецЕсли;				
				
			КонецЕсли;			
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Создает новое сообщение рассылки.
//
Функция ЗаписатьНовоеСообщение(Пользователь, ДополнительныеАдресаМассив) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовоеСообщениеОбъект = Документы.СообщениеСУО.СоздатьДокумент();
	НовоеСообщениеОбъект.Дата                   = ТекущаяДата();
	НовоеСообщениеОбъект.Пользователь           = Автор;
	НовоеСообщениеОбъект.ТолькоЭлектроннаяПочта = ТолькоЭлектроннаяПочта;
	
	НоваяТемаОбъект = Справочники.ТемыСообщенийСУО.СоздатьЭлемент();
	
	Если БезШаблона Тогда			
		НовоеСообщениеОбъект.Шаблон = Ссылка; // Шаблон будет заполнен после записи в базу рассылки,
		                                      // Если запись сообщения выполняется перед записью											  
		НоваяТемаОбъект.Наименование = Заголовок;		
	Иначе				
		НовоеСообщениеОбъект.Шаблон  = Шаблон;		
		НоваяТемаОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовоеСообщениеОбъект.Шаблон, "Заголовок");		
	КонецЕсли;	
	
	НоваяТемаОбъект.Автор        = Автор;
	НоваяТемаОбъект.Кому         = Перечисления.АдресатыСообщенийСУО.Пользователю;
	НоваяТемаОбъект.Контекст     = Пользователь;
	
	НоваяТемаОбъект.Записать();
	
	НовоеСообщениеОбъект.Тема = НоваяТемаОбъект.Ссылка;	
	НовоеСообщениеОбъект.ПервоеСообщениеВТеме = Истина;	
	НовоеСообщениеОбъект.Рассылка = Ссылка;	
		
	Для каждого ДополнительныйАдрес Из ДополнительныеАдресаМассив Цикл	
		НоваяСтрока = НовоеСообщениеОбъект.ДополнительныеАдреса.Добавить();
	    НоваяСтрока.АдресЭлектроннойПочты = ДополнительныйАдрес; 
	КонецЦикла;
	
	НовоеСообщениеОбъект.Записать();
	
	Возврат НовоеСообщениеОбъект.Ссылка;
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторОбъектаКопирования = ОбъектКопирования.Ссылка.УникальныйИдентификатор();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ШаблоныСообщенийСУО") Тогда
		
		Шаблон = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПеременные Из ДанныеЗаполнения.Переменные Цикл
			НоваяСтрока = ЗначенияПеременных.Добавить();
			НоваяСтрока.Переменная = ТекСтрокаПеременные.Переменная;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда

		Для Каждого ТекСтрокаСостав Из ДанныеЗаполнения.Состав Цикл
			НоваяСтрока = Адресаты.Добавить();
			НоваяСтрока.Пользователь = ТекСтрокаСостав.Пользователь;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		
		ТаблицаУчастников = Документы.ПроведениеОбученияСУО.УчастникиОбучения(ДанныеЗаполнения);
		
		Для Каждого Строка Из ТаблицаУчастников Цикл
			НоваяСтрока = Адресаты.Добавить();
			НоваяСтрока.Пользователь = Строка.Пользователь;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		
		ТаблицаУчастников = Документы.ПроведениеПрограммыОбученияСУО.Участники(ДанныеЗаполнения);
		
		Для Каждого Строка Из ТаблицаУчастников Цикл
			НоваяСтрока = Адресаты.Добавить();
			НоваяСтрока.Пользователь = Строка.Пользователь;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если БезШаблона Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Шаблон");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Адресаты.Количество() > 0 Тогда
		Действующая = Истина;
	Иначе
		Действующая = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Строка Из Адресаты Цикл
		
		Если ЗначениеЗаполнено(Строка.Сообщение) Тогда
			
			Если НЕ ПометкаУдаления Тогда
				
				// Если сообщение пользователя существует и помечено на удаление, то
				// удаляем пометку на удаление.
				
				ПометкаУдаленияСообщения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Сообщение, "ПометкаУдаления");
				
				Если ПометкаУдаленияСообщения Тогда
					СообщениеОбъект = Строка.Сообщение.ПолучитьОбъект(); 
					СообщениеОбъект.ПометкаУдаления = Ложь;
					СообщениеОбъект.Записать();
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ДополнительныеАдресаМассив = Новый Массив;
			СтрокиДополнительныеАдресаПользователя = ДополнительныеАдреса.НайтиСтроки(Новый Структура("Пользователь", Строка.Пользователь));
			Для каждого СтрокаДА Из СтрокиДополнительныеАдресаПользователя Цикл
				ДополнительныеАдресаМассив.Добавить(СтрокаДА.АдресЭлектроннойПочты);
			КонецЦикла;
			НовоеСообщение   = ЗаписатьНовоеСообщение(Строка.Пользователь, ДополнительныеАдресаМассив); 
			Строка.Сообщение = НовоеСообщение; // Запоминаем сообщение пользователю
			
		КонецЕсли;
		
	КонецЦикла;	
	
	// Заполняем организаторов
	
	МассивКандидатовВОрганизаторы = Новый Массив;
	Справочники.ОрганизаторыСУО.ОрганизаторыПользователя(Автор, МассивКандидатовВОрганизаторы);
	Справочники.ОрганизаторыСУО.ОрганизаторыЭлемента(Основание, МассивКандидатовВОрганизаторы);	
	Справочники.ОрганизаторыСУО.ОрганизаторыЭлемента(ОснованиеАвтоматическойРассылки, МассивКандидатовВОрганизаторы);		
	Справочники.ОрганизаторыСУО.ЗаполнитьТабличнуюЧастьОрганизаторы(Организаторы, МассивКандидатовВОрганизаторы); 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);		
	
	// Заполняем реквизит Рассылка и Шаблон у сообщений.
	// Он может быть заполнен уже после записи рассылки в базу данных для новых объектов.
	
	Для каждого СтрокаТЧ Из Адресаты Цикл
	
		НовоеСообщениеОбъект = СтрокаТЧ.Сообщение.ПолучитьОбъект();
		
		НовоеСообщениеОбъект.Рассылка = Ссылка;
		
		Если БезШаблона Тогда
			НовоеСообщениеОбъект.Шаблон = Ссылка;
		КонецЕсли;
		
		НовоеСообщениеОбъект.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассылкаСообщенийСУОАдресаты.Сообщение КАК Ссылка
		|ИЗ
		|	Документ.РассылкаСообщенийСУО.Адресаты КАК РассылкаСообщенийСУОАдресаты
		|ГДЕ
		|	РассылкаСообщенийСУОАдресаты.Сообщение.Проведен = ЛОЖЬ
		|	И РассылкаСообщенийСУОАдресаты.Сообщение.ПометкаУдаления = ЛОЖЬ
		|	И РассылкаСообщенийСУОАдресаты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ОбщегоНазначенияСУ.ПерепровестиВыборкуДокументов(ВыборкаДетальныеЗаписи, РежимЗаписиДокумента.Проведение, ДополнительныеСвойства);
		
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПользовательОснования(ТекущееОснование)
	
	Пользователь = Неопределено;
	ТипОснования = ТипЗнч(ТекущееОснование);
	
	Если ТипОснования = Тип("СправочникСсылка.Пользователи") Тогда
		Пользователь = ТекущееОснование;
	КонецЕсли;

	Если ТипОснования = Тип("ДокументСсылка.ВосстановлениеПароляСУ")
		ИЛИ ТипОснования = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
	    ИЛИ ТипОснования = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО")
		ИЛИ ТипОснования = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		
		Пользователь = ТекущееОснование.Пользователь;

	КонецЕсли;
	
	Возврат Пользователь;
	
КонецФункции

#КонецОбласти


#КонецЕсли
